#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-4wN5PSK7T7gVr1gY

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.us_east_1_backups["com.shapeshed.auster"]: Refreshing state... [id=com.shapeshed.auster]
aws_s3_bucket.us_east_1_backups["com.shapeshed.cdn"]: Refreshing state... [id=com.shapeshed.cdn]
aws_s3_bucket.us_east_1_backups["com.shapeshed.wozniak"]: Refreshing state... [id=com.shapeshed.wozniak]
aws_acm_certificate.samornbo_com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/653e8067-067e-4362-900e-32d00c5629ad]
aws_s3_bucket.samornbo-com: Refreshing state... [id=samornbo.com]
aws_acm_certificate.shapeshed_com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/558d6912-425b-4002-8c7f-6a7fe9b9d408]
aws_s3_bucket.us_east_1_backups["com.shapeshed.clearmatics"]: Refreshing state... [id=com.shapeshed.clearmatics]
aws_s3_bucket.us_east_1_backups["com.shapeshed.bomberg"]: Refreshing state... [id=com.shapeshed.bomberg]
aws_s3_bucket.us_east_1_backups["com.shapeshed.orwell"]: Refreshing state... [id=com.shapeshed.orwell]
aws_s3_bucket_public_access_block.samornbo-com: Refreshing state... [id=samornbo.com]
aws_s3_bucket_versioning.samornbo-com: Refreshing state... [id=samornbo.com]
aws_s3_bucket_acl.samornbo-com: Refreshing state... [id=samornbo.com,private]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.bomberg"]: Refreshing state... [id=com.shapeshed.bomberg]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.bomberg"]: Refreshing state... [id=com.shapeshed.bomberg]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.wozniak"]: Refreshing state... [id=com.shapeshed.wozniak]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.orwell"]: Refreshing state... [id=com.shapeshed.orwell]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.clearmatics"]: Refreshing state... [id=com.shapeshed.clearmatics]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.cdn"]: Refreshing state... [id=com.shapeshed.cdn]
aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.auster"]: Refreshing state... [id=com.shapeshed.auster]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.cdn"]: Refreshing state... [id=com.shapeshed.cdn]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.clearmatics"]: Refreshing state... [id=com.shapeshed.clearmatics]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.auster"]: Refreshing state... [id=com.shapeshed.auster]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.orwell"]: Refreshing state... [id=com.shapeshed.orwell]
aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.wozniak"]: Refreshing state... [id=com.shapeshed.wozniak]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.wozniak"]: Refreshing state... [id=com.shapeshed.wozniak,private]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.auster"]: Refreshing state... [id=com.shapeshed.auster,private]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.bomberg"]: Refreshing state... [id=com.shapeshed.bomberg,private]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.cdn"]: Refreshing state... [id=com.shapeshed.cdn,private]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.clearmatics"]: Refreshing state... [id=com.shapeshed.clearmatics,private]
aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.orwell"]: Refreshing state... [id=com.shapeshed.orwell,private]
aws_ses_domain_identity.shapeshed_com: Refreshing state... [id=shapeshed.com]
aws_route53_zone.samornbo-com: Refreshing state... [id=Z00253943FAW86XB9US01]
aws_s3_bucket.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_cloudfront_origin_access_control.samornbo_com: Refreshing state... [id=E3MTFI3TIGX1NE]
aws_s3_bucket.creative-corners: Refreshing state... [id=creative-corners]
aws_s3_bucket.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
aws_s3_bucket.mta_sts_shapeshed_com: Refreshing state... [id=mta-sts.shapeshed.com]
aws_ses_domain_dkim.shapeshed_com: Refreshing state... [id=shapeshed.com]
aws_route53_record.samornbo_com_acm_validation["*.samornbo.com"]: Refreshing state... [id=Z00253943FAW86XB9US01__d942f6056bffc9341b15dc18a61b3093.samornbo.com._CNAME]
aws_route53_record.samornbo_com_acm_validation["samornbo.com"]: Refreshing state... [id=Z00253943FAW86XB9US01__d942f6056bffc9341b15dc18a61b3093.samornbo.com._CNAME]
aws_cloudfront_distribution.samornbo_com: Refreshing state... [id=E1FHIEOD6JROUU]
aws_route53_record.moxie_shapeshed_com_aaaa: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.shapeshed_com_soa: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_ns: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.moxie_shapeshed_com_a: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.shapeshed_com_mx: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.shapeshed_com_amazonses_dkim_record[0]: Refreshing state... [id=Z0914809299OFXJQ90CQ9_a7jfv44lqsi6fc6pl52vjhwxu3ftsq6c._domainkey_CNAME]
aws_route53_record.shapeshed_com_amazonses_dkim_record[1]: Refreshing state... [id=Z0914809299OFXJQ90CQ9_2qsct3oss2ad7ixmpdbrmyviuruodw3p._domainkey_CNAME]
aws_route53_record.shapeshed_com_amazonses_dkim_record[2]: Refreshing state... [id=Z0914809299OFXJQ90CQ9_6mnbs7onefl5ocdj2alp5mpvx37ntsmk._domainkey_CNAME]
aws_route53_record.shapeshed_com_acm_validation["*.shapeshed.com"]: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com._CNAME]
aws_route53_record.shapeshed_com_acm_validation["shapeshed.com"]: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com._CNAME]
aws_route53_record.samornbo-com_A: Refreshing state... [id=Z00253943FAW86XB9US01_samornbo.com_A]
aws_route53_record.samornbo-com_AAAA: Refreshing state... [id=Z00253943FAW86XB9US01_samornbo.com_AAAA]
aws_acm_certificate_validation.samornbo_com: Refreshing state... [id=2023-03-14 13:33:41.632 +0000 UTC]
aws_s3_bucket_versioning.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_s3_bucket_public_access_block.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_s3_bucket_acl.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com,private]
aws_cloudfront_origin_access_control.static_shapeshed_com: Refreshing state... [id=E1IIZUUZGRNE2J]
aws_s3_bucket_acl.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com,private]
aws_s3_bucket_public_access_block.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_s3_bucket_versioning.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_s3_bucket_versioning.creative-corners-bucket_versioning: Refreshing state... [id=creative-corners]
aws_s3_bucket_public_access_block.creative-corners_public_access_block: Refreshing state... [id=creative-corners]
aws_s3_bucket_acl.creative-corners_acl: Refreshing state... [id=creative-corners,private]
aws_acm_certificate_validation.shapeshed_com: Refreshing state... [id=2023-02-28 20:54:30.75 +0000 UTC]
aws_cloudfront_distribution.shapeshed_com: Refreshing state... [id=EOEO7HZP7EIIC]
aws_route53_record.shapeshed_com_a: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.shapeshed_com_aaaa: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_cloudfront_origin_access_control.mta_sts_shapeshed_com: Refreshing state... [id=E2EFKWER0F7LH0]
aws_s3_bucket_versioning.mta_sts_shapeshed_com: Refreshing state... [id=mta-sts.shapeshed.com]
aws_s3_bucket_public_access_block.mta_sts_shapeshed_com: Refreshing state... [id=mta-sts.shapeshed.com]
aws_s3_bucket_acl.mta_sts_shapeshed_com: Refreshing state... [id=mta-sts.shapeshed.com,private]
aws_cloudfront_distribution.mta_sts_shapeshed_com: Refreshing state... [id=E4YWMCES95MZH]
aws_route53_record.mta_sts_shapeshed_com_a: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mta-sts.shapeshed.com_A]
aws_route53_record.mta_sts_shapeshed_com_aaaa: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mta-sts.shapeshed.com_AAAA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mta_sts_shapeshed_com_txt will be created
  + resource "aws_route53_record" "mta_sts_shapeshed_com_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_mta-sts.shapeshed.com"
      + records         = [
          + "v=STSv1;id=1681810094392;",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

  # aws_route53_record.smtp_tls_shapeshed_com_txt will be created
  + resource "aws_route53_record" "smtp_tls_shapeshed_com_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_smtp._tls.shapeshed.com"
      + records         = [
          + "v=TLSRPTv1;rua=mailto:smtp-tls-reports@shapeshed.com;",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @shapeshed, Action: `pull_request`*